pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr60471.h
/* SAPHPGC Control Bits */
#define EPULS                            (0x007f)        /* */
#define EPULS_L                          (0x007f)
#define EPULS0                           (0x0001)        /* */
#define EPULS0_L                         (0x0001)
#define EPULS1                           (0x0002)        /* */
#define EPULS1_L                         (0x0002)
#define EPULS2                           (0x0004)        /* */
#define EPULS2_L                         (0x0004)
#define EPULS3                           (0x0008)        /* */
#define EPULS3_L                         (0x0008)
#define EPULS4                           (0x0010)        /* */
#define EPULS4_L                         (0x0010)
#define EPULS5                           (0x0020)        /* */
#define EPULS5_L                         (0x0020)
#define EPULS6                           (0x0040)        /* */
#define EPULS6_L                         (0x0040)
#define SPULS                            (0x0f00)        /* */
#define SPULS_H                          (0x000f)
#define SPULS0                           (0x0100)        /* */
#define SPULS0_H                         (0x0001)
#define SPULS1                           (0x0200)        /* */
#define SPULS1_H                         (0x0002)
#define SPULS2                           (0x0400)        /* */
#define SPULS2_H                         (0x0004)
#define SPULS3                           (0x0800)        /* */
#define SPULS3_H                         (0x0008)
#define PPOL                             (0x2000)        /* */
#define PPOL_H                           (0x0020)
#define PPOL_0                           (0x0000)        /* The excitation begins with logical high phase. The stop 
                                                            begines with logical low phase. */
#define PPOL_1                           (0x2000)        /* The excitation begins with logical low phase. The stop begines
                                                            with logical high phase. */
#define PPOL_1_H                         (0x0020)
#define PLEV                             (0x4000)        /* */
#define PLEV_H                           (0x0040)
#define PLEV_0                           (0x0000)        /* PPG output is low during inactive */
#define PLEV_1                           (0x4000)        /* PPG output is high during inactive */
#define PLEV_1_H                         (0x0040)
#define PHIZ                             (0x8000)        /* */
#define PHIZ_H                           (0x0080)
#define PHIZ_0                           (0x0000)        /* PPG output during inactive is determined by PGC.PLEV bit. */
#define PHIZ_1                           (0x8000)        /* PPG output is in Hi-Z during inactive regardless of PGC.PLEV 
                                                            bit. */
#define PHIZ_1_H                         (0x0080)

/* SAPHPGLPER Control Bits */
#define LPER                             (0x00ff)        /* */
#define LPER_L                           (0x00ff)
#define LPER0                            (0x0001)        /* */
#define LPER0_L                          (0x0001)
#define LPER1                            (0x0002)        /* */
#define LPER1_L                          (0x0002)
#define LPER2                            (0x0004)        /* */
#define LPER2_L                          (0x0004)
#define LPER3                            (0x0008)        /* */
#define LPER3_L                          (0x0008)
#define LPER4                            (0x0010)        /* */
#define LPER4_L                          (0x0010)
#define LPER5                            (0x0020)        /* */
#define LPER5_L                          (0x0020)
#define LPER6                            (0x0040)        /* */
#define LPER6_L                          (0x0040)
#define LPER7                            (0x0080)        /* */
#define LPER7_L                          (0x0080)

/* SAPHPGHPER Control Bits */
#define HPER                             (0x00ff)        /* */
#define HPER_L                           (0x00ff)
#define HPER0                            (0x0001)        /* */
#define HPER0_L                          (0x0001)
#define HPER1                            (0x0002)        /* */
#define HPER1_L                          (0x0002)
#define HPER2                            (0x0004)        /* */
#define HPER2_L                          (0x0004)
#define HPER3                            (0x0008)        /* */
#define HPER3_L                          (0x0008)
#define HPER4                            (0x0010)        /* */
#define HPER4_L                          (0x0010)
#define HPER5                            (0x0020)        /* */
#define HPER5_L                          (0x0020)
#define HPER6                            (0x0040)        /* */
#define HPER6_L                          (0x0040)
#define HPER7                            (0x0080)        /* */
#define HPER7_L                          (0x0080)

/* SAPHPGCTL Control Bits */
#define PGSEL                            (0x0001)        /* */
#define PGSEL_L                          (0x0001)
#define PGSEL_0                          (0x0000)        /* PPG output channel is selected by PGCTL.PPGCHSEL bit (register
                                                            mode). */
#define PGSEL_1                          (0x0001)        /* PPG output channel is selected by ASQ (auto mode). */
#define PGSEL_1_L                        (0x0001)
#define PPGCHSEL                         (0x0002)        /* */
#define PPGCHSEL_L                       (0x0002)
#define PPGCHSEL_0                       (0x0000)        /* CH0 is selected */
#define PPGCHSEL_1                       (0x0002)        /* CH1 is selected */
#define PPGCHSEL_1_L                     (0x0002)
#define TRSEL                            (0x0030)        /* */
#define TRSEL_L                          (0x0030)
#define TRSEL0                           (0x0010)        /* */
#define TRSEL0_L                         (0x0010)
#define TRSEL1                           (0x0020)        /* */
#define TRSEL1_L                         (0x0020)
#define TRSEL_0                          (0x0000)        /* Writing 1 to PPGTRIG.PPGTRIG to trigger the PPG (start pulse 
                                                            generation). */
#define TRSEL_1                          (0x0010)        /* PPG trigger is controlled by the ASQ. */
#define TRSEL_1_L                        (0x0010)
#define TRSEL_2                          (0x0020)        /* Ext. Signal (See device specific datasheet) */
#define TRSEL_2_L                        (0x0020)
#define TRSEL_3                          (0x0030)        /* Ext. Signal (See device specific datasheet) */
#define TRSEL_3_L                        (0x0030)
#define PPGEN                            (0x0200)        /* */
#define PPGEN_H                          (0x0002)
#define PPGEN_0                          (0x0000)        /* PPG trigger is disabled. */
#define PPGEN_1                          (0x0200)        /* PPG trigger is enabled. */
#define PPGEN_1_H                        (0x0002)
#define TONE                             (0x4000)        /* */
#define TONE_H                           (0x0040)
#define TONE_0                           (0x0000)        /* Test tone generation is disabled.  Note: This bit is 
                                                            automatically cleared when writing '1' to PGCTL.STOP, and it 
                                                            stops test tone generation immediately. */
#define TONE_1                           (0x0000)        /* Test tone generation is enabled. */
#define TONE__DISABLE                    (0x0000)        /* Test tone generation is disabled.  Note: This bit is 
                                                            automatically cleared when writing '1' to PGCTL.STOP, and it 
                                                            stops test tone generation immediately. */
#define TONE__ENABLE                     (0x0000)        /* Test tone generation is enabled. */
#define PPGSTOP                          (0x8000)        /* */
#define PPGSTOP_H                        (0x0080)
#define PSCEN                            (0x2000)        /* */
#define PSCEN_H                          (0x0020)
#define PSCEN_0                          (0x0000)        /* Prescaler is disabled. PPG clock = PLL output clock. */
#define PSCEN_1                          (0x2000)        /* Prescaler by four is enabled. PPG clock = 1/4 of the PLL 
                                                            output clock. */
#define PSCEN_1_H                        (0x0020)
#define PSCEN__DISABLE                   (0x0000)        /* Prescaler is disabled. PPG clock = PLL output clock. */
#define PSCEN__ENABLE                    (0x2000)        /* Prescaler by four is enabled. PPG clock = 1/4 of the PLL 
                                                            output clock. */
#define PSCEN__ENABLE_H                  (0x0020)

/* SAPHPPGTRIG Control Bits */
#define PPGTRIG                          (0x0001)        /* */
#define PPGTRIG_L                        (0x0001)

