pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr60471.h
/* SDHS Register Offsets */
#define OFS_SDHSIIDX                     (0x0000)
#define OFS_SDHSIIDX_L                   OFS_SDHSIIDX
#define OFS_SDHSIIDX_H                   OFS_SDHSIIDX+1
#define OFS_SDHSMIS                      (0x0002)
#define OFS_SDHSMIS_L                    OFS_SDHSMIS
#define OFS_SDHSMIS_H                    OFS_SDHSMIS+1
#define OFS_SDHSRIS                      (0x0004)
#define OFS_SDHSRIS_L                    OFS_SDHSRIS
#define OFS_SDHSRIS_H                    OFS_SDHSRIS+1
#define OFS_SDHSIMSC                     (0x0006)
#define OFS_SDHSIMSC_L                   OFS_SDHSIMSC
#define OFS_SDHSIMSC_H                   OFS_SDHSIMSC+1
#define OFS_SDHSICR                      (0x0008)
#define OFS_SDHSICR_L                    OFS_SDHSICR
#define OFS_SDHSICR_H                    OFS_SDHSICR+1
#define OFS_SDHSISR                      (0x000A)
#define OFS_SDHSISR_L                    OFS_SDHSISR
#define OFS_SDHSISR_H                    OFS_SDHSISR+1
#define OFS_SDHSDESCLO                   (0x000C)
#define OFS_SDHSDESCLO_L                 OFS_SDHSDESCLO
#define OFS_SDHSDESCLO_H                 OFS_SDHSDESCLO+1
#define OFS_SDHSDESCHI                   (0x000E)
#define OFS_SDHSDESCHI_L                 OFS_SDHSDESCHI
#define OFS_SDHSDESCHI_H                 OFS_SDHSDESCHI+1
#define OFS_SDHSCTL0                     (0x0010)
#define OFS_SDHSCTL0_L                   OFS_SDHSCTL0
#define OFS_SDHSCTL0_H                   OFS_SDHSCTL0+1
#define OFS_SDHSCTL1                     (0x0012)
#define OFS_SDHSCTL1_L                   OFS_SDHSCTL1
#define OFS_SDHSCTL1_H                   OFS_SDHSCTL1+1
#define OFS_SDHSCTL2                     (0x0014)
#define OFS_SDHSCTL2_L                   OFS_SDHSCTL2
#define OFS_SDHSCTL2_H                   OFS_SDHSCTL2+1
#define OFS_SDHSCTL3                     (0x0016)
#define OFS_SDHSCTL3_L                   OFS_SDHSCTL3
#define OFS_SDHSCTL3_H                   OFS_SDHSCTL3+1
#define OFS_SDHSCTL4                     (0x0018)
#define OFS_SDHSCTL4_L                   OFS_SDHSCTL4
#define OFS_SDHSCTL4_H                   OFS_SDHSCTL4+1
#define OFS_SDHSCTL5                     (0x001A)
#define OFS_SDHSCTL5_L                   OFS_SDHSCTL5
#define OFS_SDHSCTL5_H                   OFS_SDHSCTL5+1
#define OFS_SDHSCTL6                     (0x001C)
#define OFS_SDHSCTL6_L                   OFS_SDHSCTL6
#define OFS_SDHSCTL6_H                   OFS_SDHSCTL6+1
#define OFS_SDHSCTL7                     (0x001E)
#define OFS_SDHSCTL7_L                   OFS_SDHSCTL7
#define OFS_SDHSCTL7_H                   OFS_SDHSCTL7+1
#define OFS_SDHSDT                       (0x0022)
#define OFS_SDHSDT_L                     OFS_SDHSDT
#define OFS_SDHSDT_H                     OFS_SDHSDT+1
#define OFS_SDHSWINHITH                  (0x0024)
#define OFS_SDHSWINHITH_L                OFS_SDHSWINHITH
#define OFS_SDHSWINHITH_H                OFS_SDHSWINHITH+1
#define OFS_SDHSWINLOTH                  (0x0026)
#define OFS_SDHSWINLOTH_L                OFS_SDHSWINLOTH
#define OFS_SDHSWINLOTH_H                OFS_SDHSWINLOTH+1
#define OFS_SDHSDTCDA                    (0x0028)
#define OFS_SDHSDTCDA_L                  OFS_SDHSDTCDA
#define OFS_SDHSDTCDA_H                  OFS_SDHSDTCDA+1

/* SDHS Control Bits */

/* SDHSIIDX Control Bits */
#define IIDX_5                           (0x000a)        /* Interrupt Source: RIS.WINHI */
#define IIDX_5_L                         (0x000a)
#define IIDX_6                           (0x000c)        /* Interrupt Source: RIS.WINLO */
#define IIDX_6_L                         (0x000c)
#define IIDX_7                           (0x000e)        /* Reserved; Interrupt */
#define IIDX_7_L                         (0x000e)
#define IIDX_8                           (0x0010)        /* Reserved; Interrupt Priority: Lowest */
#define IIDX_8_L                         (0x0010)

/* SDHSMIS Control Bits */
#define DTRDY                            (0x0008)        /* SDHS Data Ready Masked Interrupt Status bit. */
#define DTRDY_L                          (0x0008)
#define DTRDY_0                          (0x0000)        /* No interrupt pending */
#define DTRDY_1                          (0x0008)        /* Interrupt pending */
#define DTRDY_1_L                        (0x0008)
#define SSTRG                            (0x0004)        /* SDHS Start Conversion Trigger Masked Interrupt Status bit. */
#define SSTRG_L                          (0x0004)
#define SSTRG_0                          (0x0000)        /* No interrupt pending */
#define SSTRG_1                          (0x0004)        /* Interrupt pending */
#define SSTRG_1_L                        (0x0004)
#define OVF                              (0x0001)        /* SDHS Data Overflow Masked Interrupt Status bit. */
#define OVF_L                            (0x0001)
#define OVF_0                            (0x0000)        /* No interrupt pending */
#define OVF_1                            (0x0001)        /* Interrupt pending */
#define OVF_1_L                          (0x0001)
#define ACQDONE                          (0x0002)        /* Acquisition Done Masked Interrupt Status bit. */
#define ACQDONE_L                        (0x0002)
#define ACQDONE_0                        (0x0000)        /* No interrupt pending */
#define ACQDONE_1                        (0x0002)        /* Interrupt pending */
#define ACQDONE_1_L                      (0x0002)
#define WINHI                            (0x0010)        /* SDHS Window High Masked Interrupt Status bit. */
#define WINHI_L                          (0x0010)
#define WINHI_0                          (0x0000)        /* No interrupt pending */
#define WINHI_1                          (0x0010)        /* Interrupt pending */
#define WINHI_1_L                        (0x0010)
#define WINLO                            (0x0020)        /* SDHS Window Low Masked Interrupt Status and Clear bit. */
#define WINLO_L                          (0x0020)
#define WINLO_0                          (0x0000)        /* No interrupt pending */
#define WINLO_1                          (0x0020)        /* Interrupt pending */
#define WINLO_1_L                        (0x0020)

/* SDHSRIS Control Bits */
#define ISTOP                            (0x8000)        /* Incomplete Stop Status bit. */
#define ISTOP_H                          (0x0080)
#define ISTOP_0                          (0x0000)        /* No ISTOP event */
#define ISTOP_1                          (0x8000)        /* Conversion has been interrupted and stopped before completing 
                                                            the number of samples defined in CTL2.SAMPSZ. */
#define ISTOP_1_H                        (0x0080)

